---
type: CircuitNamingSchemeSettings
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 4
tags: [revit-api, class]
---

# CircuitNamingSchemeSettings

`Autodesk.Revit.DB.Electrical.CircuitNamingSchemeSettings` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetCircuitNamingSchemeSettings | 2021 | `public static CircuitNamingSchemeSettings GetCircuitNamingSchemeSettings ( Document cda )` |
| Method | IsValidCircuitNamingSchemeId | 2021 | `public static bool IsValidCircuitNamingSchemeId ( Document aDocument , ElementId circuitNamingSchemeId )` |
| Property | CircuitNamingSchemeId | 2021 | `public ElementId CircuitNamingSchemeId { get ; set ; }` |
| Property | Parameter | — | `` |